Tekla Open API Reference for Tekla Structures 2025
AnalysisCrossSection.Calculated Property
 Indicates whether section values have been calculated.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Calculated { get; set; }
Public Property Calculated As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnalysisCrossSection Class
Tekla.Structures.Analysis Namespace